>_< Welcome to MiniSQL
MiniSQL> Processed user input: CREATE DATABASE db_university; 
Database db_university created.
MiniSQL> Processed user input: USE DATABASE db_university; 
Using database db_university.
MiniSQL> Processed user input: CREATE TABLE students (     ID INTEGER,     Name TEXT,     GPA FLOAT ); 
Column ID of type INTEGER, added to students.
Column Name of type TEXT, added to students.
Column GPA of type FLOAT added to students.
Table students created.
MiniSQL> Processed user input: INSERT INTO students VALUES ( 1000 , "Jay Chou" , 3.0 ); 
Inserting into table: students
Row inserted into students.
MiniSQL> Processed user input: INSERT INTO students VALUES ( 1002 , "David Tao" , 3.8 ); 
Inserting into table: students
Row inserted into students.
MiniSQL> Processed user input: INSERT INTO students VALUES ( 1003 , "JJ Lin" , 3.9 ); 
Inserting into table: students
Row inserted into students.
MiniSQL> Processed user input: DELETE FROM students WHERE ID = 1003; 
Rows deleted from students where ID = 1003.
MiniSQL> Processed user input: UPDATE students SET GPA = 3.0 WHERE ID = 1000; 
Table students updated.
MiniSQL> Processed user input: SELECT ID , Name , GPA FROM students; 
Table students contents:
-------------------------------- 
ID, Name, GPA
1000, "Jay Chou", 3.00 
1002, "David Tao", 3.80 
MiniSQL> Processed user input: SELECT * FROM students; 
Table students contents:
-------------------------------- 
ID, Name, GPA
1000, "Jay Chou", 3.00 
1002, "David Tao", 3.80 
MiniSQL> Processed user input: SELECT ID , Name , GPA FROM students WHERE GPA > 2.5; 
whereColumn: GPA
whereOperator: >
whereValueStr: 2.5
Table students contents:
-------------------------------- 
ID, Name, GPA
1000, "Jay Chou", 3.00 
1002, "David Tao", 3.80 
MiniSQL> Processed user input: 
Done
